# GetCategory Method (Document, BuiltInCategory) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..GetCategory Method (Document, BuiltInCategory)
Category Class See Also
---
Retrieves a category object corresponding to a BuiltInCategory id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static Category GetCategory(
	Document document,
	BuiltInCategory categoryId
)
```

Visual Basic
---
```text
Public Shared Function GetCategory ( _
	document As Document, _
	categoryId As BuiltInCategory _
) As Category
```

Visual C++
---
```text
public:
static Category^ GetCategory(
	Document^ document,
	BuiltInCategory categoryId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..DocumentThe document.
categoryId
    Type: Autodesk.Revit.DB..::..BuiltInCategoryA built in category id.
# ### Return Value
Returns a category object corresponding to a BuiltInCategory id.
# See Also
Category Class
GetCategory Overload
Autodesk.Revit.DB Namespace